label princess:
    play music "music/song.mp3"
    scene koridor
    with slo
    "*гуляя коридорами замка ты услышал мелодию фортепиано, что доносилась из хола*"
    scene hol
    with slo
    "*ты подошел ко входу в холл и увидел стоящее в центре зала фортепиано*"
    "*за инструментом сидела девушка, элегантно перебирая клавиши*"
    "*волшебная мелодия разливалась по комнате заставляя твоё серце трепетать и бится чаще*"
    "*казалось будто всё вокруг кроме этого фортепиано и песни, что заполнила всё твоё внимание перестало существовать*"
    "*в этот момент все твои проблемы казались такими далёкими*"
    "*мелодия, которую играла эта девушка - была неизвестна тебе, но казалось, что ты слышал её бесчетное количество раз*"
    "*ты хотел подойти ближе, но только ты сделал шаг, как песнь оборвалась и девушка обратила на тебя своё внимание*"
    stop music
    show princes_norm at right
    show vitnorm at left
    with slo
    "Девушка""Кто здесь?"
    menu:
        "Прости если напугал, я был очарован твоей игрой.":
            "Девушка""Ну знаешь, такое мне много раз уже говорили."
            "Девушка""Так что ты меня не удивил."
            "Какая-то борзая шкура..."
            i"Я Виталик, Виталик со Сновска, а как вас зовут прекрасная дева?"
            "Девушка""А я - Фатима, дочь царя."
            hide vitnorm
            show vitsmile at left
            with slo
            "*у тебя невольно вырвался смешок, но царевна не обратила на это внимание*"
            fa"А это не тебя папа хотел отправить на убийство дракона в лесу?"
            i"Что?"
            hide vitsmile
            show vitnorm at left
            with slo
            fa"А, так ты не знал?"
            i"Нет."
            fa"Ну, теперь знаешь."
            "Ну зашибись, блять."
            fa"Ну ты ведь победил сильнейшего воина в замке, дракон ведь для тебя не проблема?"
            i"Ты, блять, сейчас серьёзно или шутки шутишь?"
            fa"Так ты откажешься?"
            i"Конечно!"
            fa"Жаль, а отец уже приказал загрузить карету едой и выпивкой..."
            hide vitnorm
            show vitsmile at left
            with slo
            i"Да я ему глаз на жопу натяну!"
            fa"Так ты всё же едешь? Я рада, а то этот дракон уже 300 дружинников сожрал, а с тобой мы в безопасности."
            hide vitsmile
            show vitnorm at left
            with slo
            fa"Ладно, мне пора, да и тебе стоит выспаться."
            hide princes_norm
            with slo
            i"Сука."
            "*с мыслями о том, что завтра тебя сожрут ты отправился в свою комнату*"
            scene badroom
            "..."
            i"Ладно, что делать в сложившейся ситуации буду думать завтра, а сейчас пора спать."
            scene dark
            "..."
        "Дать ей в нос":
            hide princes_norm
            show princes_conf at right
            with slo
            "*метким ударом в переносицу ты посылаешь принцессу в нокаут*"    
            "..."
            i"В данной ситуации это было лучшим решением."
            ""
    return
